In [4]:
import json
import pandas as pd

In [5]:
with open('0.json','r') as x:
    out = json.load(x)
print(out)

[{'nama': 'Andi', 'usia': 22, 'kota': 'Jakarta'}, {'nama': 'Choky', 'usia': 13, 'kota': 'Medan'}, {'nama': 'Pardede', 'usia': 32, 'kota': 'Madura'}]

In [6]:
dfData = pd.DataFrame(out)
dfData

      nama  usia     kota
0     Andi    22  Jakarta
1    Choky    13    Medan
2  Pardede    32   Madura